src/logs/page/test-page-market-20250731-141742.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: src/tests/page/test-page-market.ts
        output: -

     scenarios: (100.00%) 1 scenario, 20 max VUs, 50s max duration (incl. graceful stop):
              * default: 20 looping VUs for 20s (gracefulStop: 30s)


running (01.0s), 20/20 VUs, 47 complete and 0 interrupted iterations
default   [   5% ] 20 VUs  01.0s/20s

running (02.0s), 20/20 VUs, 113 complete and 0 interrupted iterations
default   [  10% ] 20 VUs  02.0s/20s

running (03.0s), 20/20 VUs, 178 complete and 0 interrupted iterations
default   [  15% ] 20 VUs  03.0s/20s

running (04.0s), 20/20 VUs, 246 complete and 0 interrupted iterations
default   [  20% ] 20 VUs  04.0s/20s

running (05.0s), 20/20 VUs, 313 complete and 0 interrupted iterations
default   [  25% ] 20 VUs  05.0s/20s

running (06.0s), 20/20 VUs, 380 complete and 0 interrupted iterations
default   [  30% ] 20 VUs  06.0s/20s

running (07.0s), 20/20 VUs, 444 complete and 0 interrupted iterations
default   [  35% ] 20 VUs  07.0s/20s

running (08.0s), 20/20 VUs, 507 complete and 0 interrupted iterations
default   [  40% ] 20 VUs  08.0s/20s

running (09.0s), 20/20 VUs, 572 complete and 0 interrupted iterations
default   [  45% ] 20 VUs  09.0s/20s

running (10.0s), 20/20 VUs, 641 complete and 0 interrupted iterations
default   [  50% ] 20 VUs  10.0s/20s

running (11.0s), 20/20 VUs, 706 complete and 0 interrupted iterations
default   [  55% ] 20 VUs  11.0s/20s

running (12.0s), 20/20 VUs, 773 complete and 0 interrupted iterations
default   [  60% ] 20 VUs  12.0s/20s

running (13.0s), 20/20 VUs, 835 complete and 0 interrupted iterations
default   [  65% ] 20 VUs  13.0s/20s

running (14.0s), 20/20 VUs, 895 complete and 0 interrupted iterations
default   [  70% ] 20 VUs  14.0s/20s

running (15.0s), 20/20 VUs, 959 complete and 0 interrupted iterations
default   [  75% ] 20 VUs  15.0s/20s

running (16.0s), 20/20 VUs, 1024 complete and 0 interrupted iterations
default   [  80% ] 20 VUs  16.0s/20s

running (17.0s), 20/20 VUs, 1094 complete and 0 interrupted iterations
default   [  85% ] 20 VUs  17.0s/20s

running (18.0s), 20/20 VUs, 1154 complete and 0 interrupted iterations
default   [  90% ] 20 VUs  18.0s/20s

running (19.0s), 20/20 VUs, 1221 complete and 0 interrupted iterations
default   [  95% ] 20 VUs  19.0s/20s

running (20.0s), 20/20 VUs, 1286 complete and 0 interrupted iterations
default   [ 100% ] 20 VUs  20.0s/20s


  █ TOTAL RESULTS 

    checks_total.......................: 1306    64.343857/s
    checks_succeeded...................: 100.00% 1306 out of 1306
    checks_failed......................: 0.00%   0 out of 1306

    ✓ status is 200

    HTTP
    http_req_duration.......................................................: avg=304.66ms min=132.92ms med=302.17ms max=437.95ms p(90)=358.84ms p(95)=369.52ms
      { expected_response:true }............................................: avg=304.66ms min=132.92ms med=302.17ms max=437.95ms p(90)=358.84ms p(95)=369.52ms
    http_req_failed.........................................................: 0.00%  0 out of 1306
    http_reqs...............................................................: 1306   64.343857/s

    EXECUTION
    iteration_duration......................................................: avg=308.57ms min=175.87ms med=306.62ms max=621.01ms p(90)=361.15ms p(95)=376.89ms
    iterations..............................................................: 1306   64.343857/s
    vus.....................................................................: 20     min=20        max=20
    vus_max.................................................................: 20     min=20        max=20

    NETWORK
    data_received...........................................................: 43 MB  2.1 MB/s
    data_sent...............................................................: 198 kB 9.7 kB/s



running (20.3s), 00/20 VUs, 1306 complete and 0 interrupted iterations
default ✓ [ 100% ] 20 VUs  20s